#version: 0.2
c c
C C
( =
cc c
N C
cc ccc
O C
CC C
n c
C c
) =
O c
CC CC
N c
C l
cc cc
C N
) (
1 2
CC N
) -
C Oc
) (=
O CC
n H
CC c
CC CCC
C OC
n n
C O
CCC N
n cc
2 3
C NC
C S
c nc
B r
c n
NC c
s c
N CC
CC OCC
CC OC
n nc
OC c
N N
Cl c
CCCC CCCC
ccc nc
C n
N S
o c
CCCC N
F c
S C
nc nc
CC Oc
CCC NC
+ ]
CC NC
cc nc
( -
S CC
ccc o
3 4
cccc n
CCC c
N NC
S c
CS c
ccc s
cc ncc
OC Oc
( [
2 1
CCCC CC
F C
C Nc
CC O
n ccc
n o
N O
C OCC
N CCc
c nn
CCCC c
c sc
- ]
c s
CC n
n oc
n cccc
N CCC
CS C
N CCN
c ncc
CCN CC
O P
O CCN
) [
CC S
CCC O
CO P
cc n
CCC Oc
+] (
Br c
nc n
cc sc
OCC Oc
CCCC NC
N CCCN
S Cc
1 1
CCCC CCC
O CCC
ccc n
o n
1 3
cnc n
O N
ncc s
nn n
N CCCC
4 5
CN CC
OCC OCC
O S
cc oc
COC c
-] )
CC SC
N OC
CC Nc
CCC n
N CCCCC
CCCC CCCCC
O NC
N Nc
nccc n
CCCCCCCC CCCCCCCC
s ccc
ncc n
CNC c
o nc
CO CCN
O CCCC
c oc
CN S
-] [
O CCCN
CS CCC
+] ([
nn nn
cncc n
cn ccc
OCC c
CS SCC
CO N
CCC l
3 2
+] #
CCC Nc
CCCC Oc
CCC OC
CS CC
CC l
O O
CCCCC N
CC Sc
OCC O
CCCCCCCC CCCC
CCCCC c
cnc nc
no nc
nn nc
3 1
CCO P
CCC S
cn nc
ncc nc
2 2
cnn n
s nc
nc nn
CCCCCCCC CCC
NCC NC
c o
CCCCCCCC CC
CCN S
cc nn
NCC O
CCCCC NC
2 4
s cc
CN CCc
C P
OCC NC
CC SCC
N CCCc
CCCC OC
COCC NC
Cl C
O CCCOc
o ccc
N n
NCC S
CCCC CCN
N P
CS Cc
CCCC n
n snc
OCC OC
CC NCc
NCCC n
n sc
3 5
NCC Oc
OC OC
OCC CCC
CCCCCCCC CCCCCC
CCCC CCc
C F
CCCC O
O OC
-] )=
S CCN
N CCCCN
O CCCc
1 0
OCC n
nnc n
S CCC
cs cn
CO S
)= [
C Br
CCC Sc
1 4
