{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"cc":261,"CC":262,"(=":263,"ccc":264,"NC":265,"ccccc":266,"OC":267,"CCC":268,"nc":269,"Cc":270,")=":271,"Oc":272,"CCCC":273,"Nc":274,"Cl":275,"cccc":276,"CN":277,")(":278,"12":279,"CCN":280,")-":281,"COc":282,")(=":283,"OCC":284,"nH":285,"CCc":286,"CCCCC":287,"COC":288,"nn":289,"CO":290,"CCCN":291,"ncc":292,"23":293,"CNC":294,"CS":295,"cnc":296,"Br":297,"cn":298,"NCc":299,"sc":300,"NCC":301,"CCOCC":302,"CCOC":303,"nnc":304,"OCc":305,"NN":306,"Clc":307,"CCCCCCCC":308,"cccnc":309,"Cn":310,"NS":311,"oc":312,"CCCCN":313,"Fc":314,"SC":315,"ncnc":316,"CCOc":317,"CCCNC":318,"+]":319,"CCNC":320,"ccnc":321,"(-":322,"SCC":323,"ccco":324,"34":325,"ccccn":326,"CCCc":327,"NNC":328,"Sc":329,"CSc":330,"cccs":331,"ccncc":332,"OCOc":333,"([":334,"21":335,"CCCCCC":336,"FC":337,"CNc":338,"CCO":339,"nccc":340,"no":341,"NO":342,"COCC":343,"NCCc":344,"cnn":345,"CCCCc":346,"csc":347,"-]":348,"cs":349,"CCn":350,"noc":351,"ncccc":352,"NCCC":353,"CSC":354,"NCCN":355,"cncc":356,"CCNCC":357,"OP":358,"OCCN":359,")[":360,"CCS":361,"CCCO":362,"COP":363,"ccn":364,"CCCOc":365,"+](":366,"Brc":367,"ncn":368,"ccsc":369,"OCCOc":370,"CCCCNC":371,"NCCCN":372,"SCc":373,"11":374,"CCCCCCC":375,"OCCC":376,"cccn":377,"on":378,"13":379,"cncn":380,"ON":381,"nccs":382,"nnn":383,"NCCCC":384,"45":385,"CNCC":386,"OCCOCC":387,"OS":388,"ccoc":389,"COCc":390,"-])":391,"CCSC":392,"NOC":393,"CCNc":394,"CCCn":395,"NCCCCC":396,"CCCCCCCCC":397,"ONC":398,"NNc":399,"ncccn":400,"CCCCCCCCCCCCCCCC":401,"sccc":402,"nccn":403,"CNCc":404,"onc":405,"COCCN":406,"OCCCC":407,"coc":408,"CNS":409,"-][":410,"OCCCN":411,"CSCCC":412,"+]([":413,"nnnn":414,"cnccn":415,"cnccc":416,"OCCc":417,"CSSCC":418,"CON":419,"CCCl":420,"32":421,"+]#":422,"CCCNc":423,"CCCCOc":424,"CCCOC":425,"CSCC":426,"CCl":427,"OO":428,"CCCCCN":429,"CCSc":430,"OCCO":431,"CCCCCCCCCCCC":432,"CCCCCc":433,"cncnc":434,"nonc":435,"nnnc":436,"31":437,"CCOP":438,"CCCS":439,"cnnc":440,"nccnc":441,"22":442,"cnnn":443,"snc":444,"ncnn":445,"CCCCCCCCCCC":446,"NCCNC":447,"co":448,"CCCCCCCCCC":449,"CCNS":450,"ccnn":451,"NCCO":452,"CCCCCNC":453,"24":454,"scc":455,"CNCCc":456,"CP":457,"OCCNC":458,"CCSCC":459,"NCCCc":460,"CCCCOC":461,"COCCNC":462,"ClC":463,"OCCCOc":464,"occc":465,"Nn":466,"NCCS":467,"CCCCCCN":468,"NP":469,"CSCc":470,"CCCCn":471,"nsnc":472,"OCCOC":473,"CCNCc":474,"NCCCn":475,"nsc":476,"35":477,"NCCOc":478,"OCOC":479,"OCCCCC":480,"CCCCCCCCCCCCCC":481,"CCCCCCc":482,"CF":483,"CCCCO":484,"OOC":485,"-])=":486,"SCCN":487,"NCCCCN":488,"OCCCc":489,"10":490,"OCCn":491,"nncn":492,"SCCC":493,"cscn":494,"COS":495,")=[":496,"CBr":497,"CCCSc":498,"14":499}